## Production: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                        NAME                                         |
|--------|-------------------------------------------------------------------------------------|
| add    | `aws_security_group.api_end_to_end_test_lambda`                                     |
|        | `aws_security_group_rule.https_from_private_link_to_api_end_to_end_test`            |
|        | `aws_security_group_rule.local_lambda_to_api_ingress`                               |
|        | `aws_security_group_rule.local_lambda_to_idp_ingress`                               |
|        | `aws_service_discovery_private_dns_namespace.ecs_local`                             |
|        | `aws_vpc_security_group_egress_rule.https_from_api_end_to_end_test_to_private_link` |
|        | `aws_vpc_security_group_egress_rule.local_lambda_to_api`                            |
|        | `aws_vpc_security_group_egress_rule.local_lambda_to_idp`                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.api_end_to_end_test_lambda will be created
  + resource "aws_security_group" "api_end_to_end_test_lambda" {
      + arn                    = (known after apply)
      + description            = "API end to end test Lambda"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "api_end_to_end_test_lambda"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0e852a6f3554a8bca"
    }

  # aws_security_group_rule.https_from_private_link_to_api_end_to_end_test will be created
  + resource "aws_security_group_rule" "https_from_private_link_to_api_end_to_end_test" {
      + description              = "Ingress from API end to end test security group for HTTPS communication"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0799d12ff9d17bded"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.local_lambda_to_api_ingress will be created
  + resource "aws_security_group_rule" "local_lambda_to_api_ingress" {
      + description              = "Ingress to API from Lambda for local communication"
      + from_port                = 3001
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0c931cf1235f179fe"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3001
      + type                     = "ingress"
    }

  # aws_security_group_rule.local_lambda_to_idp_ingress will be created
  + resource "aws_security_group_rule" "local_lambda_to_idp_ingress" {
      + description              = "Ingress to IdP from Lambda for local communication"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-05fd447ca8b4e9d26"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # aws_service_discovery_private_dns_namespace.ecs_local will be created
  + resource "aws_service_discovery_private_dns_namespace" "ecs_local" {
      + arn         = (known after apply)
      + description = "DNS namespace used to provide service discovery for ECS services to allow for local communication (within VPC)"
      + hosted_zone = (known after apply)
      + id          = (known after apply)
      + name        = "ecs.local"
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + vpc         = "vpc-0e852a6f3554a8bca"
    }

  # aws_vpc_security_group_egress_rule.https_from_api_end_to_end_test_to_private_link will be created
  + resource "aws_vpc_security_group_egress_rule" "https_from_api_end_to_end_test_to_private_link" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Egress to the internet for HTTPS communication"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + to_port                = 443
    }

  # aws_vpc_security_group_egress_rule.local_lambda_to_api will be created
  + resource "aws_vpc_security_group_egress_rule" "local_lambda_to_api" {
      + arn                          = (known after apply)
      + description                  = "Egress from Lambda to API for local communication"
      + from_port                    = 3001
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = "sg-0c931cf1235f179fe"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + to_port                      = 3001
    }

  # aws_vpc_security_group_egress_rule.local_lambda_to_idp will be created
  + resource "aws_vpc_security_group_egress_rule" "local_lambda_to_idp" {
      + arn                          = (known after apply)
      + description                  = "Egress from Lambda to IdP for local communication"
      + from_port                    = 8080
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = "sg-05fd447ca8b4e9d26"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + to_port                      = 8080
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_end_to_end_test_lambda_security_group_id           = (known after apply)
  + service_discovery_private_dns_namespace_ecs_local_id   = (known after apply)
  + service_discovery_private_dns_namespace_ecs_local_name = "ecs.local"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_security_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_flow_log.vpc_flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_public_subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api_ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api_end_to_end_test_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.connector_db"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_database"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_egress"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_redis"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_db"]
WARN - plan.json - main - Missing...
```

</details>
